Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ВытесняемоеПлановоеВремяСотрудников/ВытесняемоеПлановоеВремяСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВытесняемоеПлановоеВремяСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПереходящаяЧастьПредыдущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходящаяЧастьТекущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/Enums/ВидыДанныхУчетаВремениСотрудников/ВидыДанныхУчетаВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДанныхУчетаВремениСотрудников</name>
  <enumValues>
    <name>ДанныеОбщихГрафиков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеИндивидуальныхГрафиков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеТабельногоУчета</name>
  </enumValues>
  <enumValues>
    <name>ДанныеОперативногоУчета</name>
  </enumValues>
  <enumValues>
    <name>ДанныеВнутрисменныхНеявок</name>
  </enumValues>
  <enumValues>
    <name>ВытесняемоеПлановоеВремя</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеВнутрисменноеВремя</name>
  </enumValues>
  <enumValues>
    <name>СводныеДанные</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ВытесняемоеПлановоеВремяСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОписаниеРегистра() Экспорт
	ОписаниеРегистра = УчетРабочегоВремениРасширенный.ОписаниеРегистраДанныхУчетаВремени();
	
	ОписаниеРегистра.МетаданныеРегистра = Метаданные.РегистрыНакопления.ВытесняемоеПлановоеВремяСотрудников;
	ОписаниеРегистра.ИмяПоляСотрудник = "Сотрудник";
	ОписаниеРегистра.ИмяПоляПериод = "Период";
	ОписаниеРегистра.ИмяПоляПериодРегистрации = "ПериодРегистрации";
	ОписаниеРегистра.ИмяПоляВидДанных = Неопределено;
	ОписаниеРегистра.ВидДанных = Перечисления.ВидыДанныхУчетаВремениСотрудников.ВытесняемоеПлановоеВремя;
	
	Возврат ОписаниеРегистра;
КонецФункции	

#КонецЕсли
